tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "cocoapods", link: false
brew "cowsay"
brew "docker"
brew "docker-compose"
brew "glib"
brew "htop"
brew "python@3.8"
brew "imagemagick"
brew "lolcat"
brew "neofetch"
brew "node"
brew "ntfs-3g"
brew "sl"
brew "youtube-dl"
brew "zsh"
cask "anaconda"
cask "android-studio"
cask "authy"
cask "brave-browser"
cask "discord"
cask "flutter"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "intellij-idea"
cask "lastpass"
cask "macfuse"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "obs"
cask "omnidisksweeper"
cask "qbittorrent"
cask "spotify"
cask "telegram"
cask "termius"
cask "visual-studio-code"
cask "vlc"
